{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 300, 300, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_3_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "batch_input_shape": [null, 300, 300, 3], "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "sparse_categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "SGD", "config": {"name": "SGD", "learning_rate": 0.009999999776482582, "decay": 0.0, "momentum": 0.0, "nesterov": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of86.bin", "group1-shard2of86.bin", "group1-shard3of86.bin", "group1-shard4of86.bin", "group1-shard5of86.bin", "group1-shard6of86.bin", "group1-shard7of86.bin", "group1-shard8of86.bin", "group1-shard9of86.bin", "group1-shard10of86.bin", "group1-shard11of86.bin", "group1-shard12of86.bin", "group1-shard13of86.bin", "group1-shard14of86.bin", "group1-shard15of86.bin", "group1-shard16of86.bin", "group1-shard17of86.bin", "group1-shard18of86.bin", "group1-shard19of86.bin", "group1-shard20of86.bin", "group1-shard21of86.bin", "group1-shard22of86.bin", "group1-shard23of86.bin", "group1-shard24of86.bin", "group1-shard25of86.bin", "group1-shard26of86.bin", "group1-shard27of86.bin", "group1-shard28of86.bin", "group1-shard29of86.bin", "group1-shard30of86.bin", "group1-shard31of86.bin", "group1-shard32of86.bin", "group1-shard33of86.bin", "group1-shard34of86.bin", "group1-shard35of86.bin", "group1-shard36of86.bin", "group1-shard37of86.bin", "group1-shard38of86.bin", "group1-shard39of86.bin", "group1-shard40of86.bin", "group1-shard41of86.bin", "group1-shard42of86.bin", "group1-shard43of86.bin", "group1-shard44of86.bin", "group1-shard45of86.bin", "group1-shard46of86.bin", "group1-shard47of86.bin", "group1-shard48of86.bin", "group1-shard49of86.bin", "group1-shard50of86.bin", "group1-shard51of86.bin", "group1-shard52of86.bin", "group1-shard53of86.bin", "group1-shard54of86.bin", "group1-shard55of86.bin", "group1-shard56of86.bin", "group1-shard57of86.bin", "group1-shard58of86.bin", "group1-shard59of86.bin", "group1-shard60of86.bin", "group1-shard61of86.bin", "group1-shard62of86.bin", "group1-shard63of86.bin", "group1-shard64of86.bin", "group1-shard65of86.bin", "group1-shard66of86.bin", "group1-shard67of86.bin", "group1-shard68of86.bin", "group1-shard69of86.bin", "group1-shard70of86.bin", "group1-shard71of86.bin", "group1-shard72of86.bin", "group1-shard73of86.bin", "group1-shard74of86.bin", "group1-shard75of86.bin", "group1-shard76of86.bin", "group1-shard77of86.bin", "group1-shard78of86.bin", "group1-shard79of86.bin", "group1-shard80of86.bin", "group1-shard81of86.bin", "group1-shard82of86.bin", "group1-shard83of86.bin", "group1-shard84of86.bin", "group1-shard85of86.bin", "group1-shard86of86.bin"], "weights": [{"name": "conv2d_3/kernel", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [175232, 512], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [512, 4], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [4], "dtype": "float32"}]}]}